from string import Template

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد إجابة للمستخدم.",
            "سيتم تزويدك بمجموعة من الوثائق ذات صلة بسؤال المستخدم.",
            "يجب عليك استخدام هذه الوثائق لتوليد الإجابة المناسبة للمستخدم.",
            "يجب أن تعتمد الإجابة على الوثائق المقدمة فقط.",
            "تجاهل أي وثائق غير مرتبطة بسؤال المستخدم.",
            "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
            "كن مختصرًا ومباشرًا.",
            "استخدم تنسيق Markdown في إجابتك.",
            "كن لبقًا وودودًا.",
            "كن محترفًا وواسع المعرفة.",
            "تجنب المعلومات غير الضرورية.",
        ]
    )
)


### الوثيقة ###
document_prompt = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)


### الخاتمة ###
footer_prompt = Template(
    "\n".join(
        [
            "بناءً فقط على المستندات المقدمة، يرجى توليد إجابة للمستخدم.",
            "## السؤال: ",
            "$query",
        ]
    )
)
